# RemovePartTag

## Description
Remove the part tag and all part information from the specified sub-object.

```pascal
FUNCTION RemovePartTag(objectHandle : HANDLE): BOOLEAN;
```

```python
def vs.RemovePartTag(objectHandle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|The sub-object handle.|

## Version
Availability: from Vectorworks 2022

## Category
* Objects - Custom